Revit 2024 API
UnitFormatUtils.TryParse Method (Units, ForgeTypeId, String, ValueParsingOptions, Double)
 Parses a formatted string into a number with units if possible.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool TryParse(
	Units units,
	ForgeTypeId specTypeId,
	string stringToParse,
	ValueParsingOptions valueParsingOptions,
	out double value
)
Visual Basic
Public Shared Function TryParse ( _
	units As Units, _
	specTypeId As ForgeTypeId, _
	stringToParse As String, _
	valueParsingOptions As ValueParsingOptions, _
	<OutAttribute> ByRef value As Double _
) As Boolean
Visual C++
public:
static bool TryParse(
	Units^ units,
	ForgeTypeId^ specTypeId,
	String^ stringToParse,
	ValueParsingOptions^ valueParsingOptions,
	[OutAttribute] double% value
)
Parameters
units
Type: Autodesk.Revit.DB.Units
 The units formatting settings, typically obtained from Document.GetUnits().
specTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 Identifier of the target spec for the value.
stringToParse
Type: System.String
 The string to parse.
valueParsingOptions
Type: Autodesk.Revit.DB.ValueParsingOptions
 Additional parsing options.
value
Type: System.Double
 The parsed value. Ignore this value if the function returns false.
Return Value
 True if the string can be parsed, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId). -or- The unit in the FormatOptions in valueParsingOptions is not a valid unit for specTypeId. See UnitUtils.IsValidUnit(ForgeTypeId, ForgeTypeId) and UnitUtils.GetValidUnits(ForgeTypeId).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
UnitFormatUtils Class
TryParse Overload
Autodesk.Revit.DB Namespace